In [5]:
import pandas as pd
import matplotlib


ds = pd.read_csv('produtos.csv')

ds.head()

,Produtos,Preço Original,Moeda,Cotação,Preço de Compra,Margem,Preço de Venda
0,Câmera Canon,"999,99",Dólar,5,"4999,95","1,4","6999,93"
1,Carro Renault,4500,Euro,6,27000,2,54000
2,Notebook Dell,"899,99",Dólar,5,"4499,95","1,7","7649,915"
3,IPhone,799,Dólar,5,3995,"1,7","6791,5"
4,Carro Fiat,3000,Euro,6,18000,"1,9",34200

In [17]:
ds.tail()

,Produtos,Preço Original,Moeda,Cotação,Preço de Compra,Margem,Preço de Venda
2,Notebook Dell,"899,99",Dólar,5,"4499,95","1,7","7649,915"
3,IPhone,799,Dólar,5,3995,"1,7","6791,5"
4,Carro Fiat,3000,Euro,6,18000,"1,9",34200
5,Celular Xiaomi,"480,48",Dólar,5,"2402,4",2,"4804,8"
6,Joia 20g,20,Ouro,350,7000,"1,15",8050

In [27]:
def convert(val):
    new_val = val.replace(',','')
    return float(new_val)

ds['Preço Original'].apply(convert)

ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Produtos         7 non-null      object
 1   Preço Original   7 non-null      object
 2   Moeda            7 non-null      object
 3   Cotação          7 non-null      int64
 4   Preço de Compra  7 non-null      object
 5   Margem           7 non-null      object
 6   Preço de Venda   7 non-null      object
dtypes: int64(1), object(6)
memory usage: 520.0+ bytes

In [21]:
ds.describe()

          Cotação
count    7.000000
mean    54.571429
std    130.272608
min      5.000000
25%      5.000000
50%      5.000000
75%      6.000000
max    350.000000

In [18]:
data_agrupada = ds.groupby(['Cotação', 'Preço Original'])
data_agrupada['Preço de Venda'].describe().unstack()

               count                                     unique            \
Preço Original    20 3000 4500 480,48  799 899,99 999,99     20 3000 4500
Cotação
5                NaN  NaN  NaN      1    1      1      1    NaN  NaN  NaN
6                NaN    1    1    NaN  NaN    NaN    NaN    NaN    1    1
350                1  NaN  NaN    NaN  NaN    NaN    NaN      1  NaN  NaN

                ...     top                    freq                        \
Preço Original  ...     799    899,99   999,99   20 3000 4500 480,48  799
Cotação         ...
5               ...  6791,5  7649,915  6999,93  NaN  NaN  NaN      1    1
6               ...     NaN       NaN      NaN  NaN    1    1    NaN  NaN
350             ...     NaN       NaN      NaN    1  NaN  NaN    NaN  NaN


Preço Original 899,99 999,99
Cotação
5                   1      1
6                 NaN    NaN
350               NaN    NaN

[3 rows x 28 columns]

In [28]:
ds['Margem'].apply(lambda x: x.replace(',', '')).astype('float')

ds.dtypes

Produtos           object
Preço Original     object
Moeda              object
Cotação             int64
Preço de Compra    object
Margem             object
Preço de Venda     object
dtype: object